src/main/resources/xml/accommodationInventoryRequestComponentServicePort/updateGuaranteedStatus/updateGuaranteedStatus.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.roominventory.wdw.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:updateGuaranteedStatus>
         <!--Optional:-->
         <request>
            <!--Optional:-->
            <guaranteedStatusFlag>?</guaranteedStatusFlag>
            <!--Optional:-->
            <ownerReferenceNumber>?</ownerReferenceNumber>
            <!--Optional:-->
            <ownerReferenceType>?</ownerReferenceType>
         </request>
         <!--Optional:-->
         <context>
            <!--Optional:-->
            <addressRole>?</addressRole>
            <!--Optional:-->
            <conversationId>?</conversationId>
            <!--Optional:-->
            <messageId>?</messageId>
            <!--Optional:-->
            <party1Id>?</party1Id>
            <!--Optional:-->
            <party1Type>?</party1Type>
            <!--Optional:-->
            <party2Id>?</party2Id>
            <!--Optional:-->
            <party2Type>?</party2Type>
            <!--Optional:-->
            <pathHostName>?</pathHostName>
            <!--Optional:-->
            <pathId>?</pathId>
            <!--Optional:-->
            <principalId>?</principalId>
            <!--Optional:-->
            <principalMethod>?</principalMethod>
            <!--Optional:-->
            <principalRole>?</principalRole>
            <!--Optional:-->
            <principalUri>?</principalUri>
            <!--Optional:-->
            <principalValue>?</principalValue>
            <!--Optional:-->
            <requestTimeStamp>?</requestTimeStamp>
            <!--Optional:-->
            <toAddressRole>?</toAddressRole>
            <!--Optional:-->
            <userName>?</userName>
         </context>
      </ser:updateGuaranteedStatus>
   </soapenv:Body>
</soapenv:Envelope>